/*!
 * Distpicker v1.0.4
 * https://github.com/fengyuanchen/distpicker
 *
 * Copyright (c) 2014-2016 Fengyuan Chen
 * Released under the MIT license
 *
 * Date: 2016-06-01T15:05:52.606Z
 */

(function (factory) {
  if (typeof define === 'function' && define.amd) {
    // AMD. Register as anonymous module.
    define('ChineseDistricts', [], factory);
  } else {
    // Browser globals.
    factory();
  }
})(function () {

  var ChineseDistricts = {
    86: {
      100000: '-市-',
      110000: '北京市'
    },
    110000: {
      110100: '东城区',
      110200: '西城区',
      110300: '朝阳区',
      110400: '丰台区',
      110500: '石景山区',
      110600: '海淀区',
      110700: '门头沟区',
      110800: '房山区',
      110900: '通州区',
      111000: '顺义区',
      111100: '昌平区',
      111200: '大兴区',
      111300: '怀柔区',
      111400: '平谷区',
      111500: '密云区',
      111600: '延庆区'
    },
    110100: {
      110101: '和平里',
      110102: '崇文门',
      110103: '王府井',
      110104: '东直门',
      110105: '朝阳门',
      110106: '朝阳门内',
      110107: '安定门'
    },
    110200: {
      110201: '德胜门',
      110202: '金融街',
      110203: '木樨地',
      110204: '西单',
      110205: '西直门'
    },
 	110300: {
      110301: '安贞',
      110302: '朝青',
      110303: '奥林匹克公园',
      110304: '北沙滩',
      110305: '北苑',
      110306: '朝阳公园',
      110307: 'CBD',
      110308: '常营',
      110309: '朝阳门外',
      110310: '定福庄',
      110311: '东坝',
      110312: '大望路',
      110313: '垡头',
      110314: '国展',
      110315: '国贸',
      110316: '管庄',
      110317: '工体',
      110318: '高碑店',
      110319: '花家地'
    },    
    110400: {
      110401: '北大地',
      110402: '菜户营',
      110403: '大红门',
      110404: '方庄',
      110405: '花乡',
      110406: '角门',
      110407: '嘉园',
      110408: '科技园',
      110409: '六里桥',
      110410: '丽泽桥',
      110411: '木樨园'
    },  
    110500: {
      110501: '八宝山',
      110502: '八大处',
      110503: '古城',
      110504: '苹果园',
      110505: '西山'
    },
    110600: {
      110601: '海淀北部',
      110602: '马连洼',
      110603: '上地',
      110604: '四季青',
      110605: '魏公村',
      110606: '万柳',
      110607: '五棵松',
      110608: '学院路',
      110609: '西三旗',
      110610: '西北旺',
      110611: '颐和园',
      110612: '中关村',
      110613: '香山',
      110614: '马连洼'
    }, 
    110700: {
      110701: '大峪',
      110702: '东辛房',
      110703: '永定镇',
      110704: '潭柘寺',
      110705: '龙门新区',
      110706: '门头沟周边',
      110707: '门头沟新城区'
    },
    110800: {
      110801: '长阳',
      110802: '窦店',
      110803: '琉璃河',
      110804: '良乡',
      110805: '燕山闫村',
      110806: '周口店',
      110807: '青龙湖',
      110808: '房山周边'
    },
    110900: {
      110901: '北关',
      110902: '果园',
      110903: '九棵树',
      110904: '梨园',
      110905: '临河里',
      110906: '潞苑',
      110907: '马驹桥',
      110908: '乔庄',
      110909: '通州北苑',
      110910: '土桥',
      110911: '武夷花园',
      110912: '新华大街',
      110913: '运河大街',
      110914: '永乐',
      110915: '台湖',
      110916: '宋庄',
      110917: '于家务'
    }, 
    111000: {
      111001: '后沙峪',
      111002: '京顺高速路',
      111003: '空港工业区',
      111004: '马坡',
      111005: '顺义城区',
      111006: '天竺',
      111007: '中央别墅区',
      111008: '顺义周边',
      111009: '赵全营',
      111010: '高丽营'
    },
    111100: {
      111101: '北七家',
      111102: '昌平县城',
      111103: '回龙观',
      111104: '立水桥',
      111105: '南邵',
      111106: '南口',
      111107: '沙河',
      111108: '天通苑',
      111109: '小汤山',
      111110: '阳坊',
      111110: '八达岭'
    },
    111200: {
      111201: '大兴周边',
      111202: '黄村',
      111203: '旧宫',
      111204: '西红门',
      111205: '亦庄',
      111206: '天宫院',
      111207: '榆垡',
      111208: '采育'
    },
    111300: {
      111301: '怀柔'
    },
    111400: {
      111401: '平谷'
    },
    111500: {
      111501: '密云'
    },
    111600: {
      111601: '延庆'
    },
  };

  if (typeof window !== 'undefined') {
    window.ChineseDistricts = ChineseDistricts;
  }

  return ChineseDistricts;

});
